chore: update REFERENCE.md
use mermaid instead of ascii art
create mermaid diagrams where visualization is missing but needed

Signed-off-by: Melvin Hillsman <mhillsma@redhat.com>
